10/data/attachments/32d4e59e29b25282.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d6f7e3ce-c392-4fac-b951-4a2e2c4aff44</nif:username>
            <nif:friendToBeAdded>Heather_however_Actions_10210_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>